# Importing the Required Libraries & Data Set

In [2]:
import pandas as pd

In [3]:
dict1={
    'Name':["Ahmed","Abdullah","Alishba","Fatima","Adnan","Ravi","Ayesha","Tanveer"],
    'Gender':["Male","Male","Female","Female","Male","Male","Female","Male"],
    'Marks':[89,77,88,90,67,86,91,79]
}

In [4]:
data=pd.DataFrame(dict1)

# Displaying top 3 Rows of the Dataset

In [5]:
data.head(3)

       Name  Gender  Marks
0     Ahmed    Male     89
1  Abdullah    Male     77
2   Alishba  Female     88

# Displaying the last 3 Rows of the Dataset

In [6]:
data.tail(3)

      Name  Gender  Marks
5     Ravi    Male     86
6   Ayesha  Female     91
7  Tanveer    Male     79

# Finding the Shape of the Dataset(No. of the Rows & Columns)

In [7]:
print("No. of the Rows:",data.shape[0])
print("No. of the Columns",data.shape[1])

No. of the Rows: 8
No. of the Columns 3

# Checking the Null Values in the Dataset

In [8]:
data.isnull().sum()

Name      0
Gender    0
Marks     0
dtype: int64

# Getting the Overall Statistics of the Dataset

In [9]:
data.describe(include='all')

         Name Gender      Marks
count       8      8   8.000000
unique      8      2        NaN
top     Ahmed   Male        NaN
freq        1      5        NaN
mean      NaN    NaN  83.375000
std       NaN    NaN   8.365533
min       NaN    NaN  67.000000
25%       NaN    NaN  78.500000
50%       NaN    NaN  87.000000
75%       NaN    NaN  89.250000
max       NaN    NaN  91.000000

# Finding the Unique Values from the Gender Column

In [10]:
data["Gender"].unique()

array(['Male', 'Female'], dtype=object)

In [11]:
data["Gender"].nunique()

2

In [12]:
data["Gender"].value_counts()

Gender
Male      5
Female    3
Name: count, dtype: int64

# Find the Total No. of the Students having the marks between 80 & 90.

In [13]:
data[data["Marks"].between(80,90)]

      Name  Gender  Marks
0    Ahmed    Male     89
2  Alishba  Female     88
3   Fatima  Female     90
5     Ravi    Male     86

# Find the Average of the Marks Column

In [14]:
data["Marks"].mean()

83.375

# Use Apply() method

In [15]:
def half(x):
    return x//2
data["Half Marks"]=data["Marks"].apply(half)

In [16]:
data.head()

       Name  Gender  Marks  Half Marks
0     Ahmed    Male     89          44
1  Abdullah    Male     77          38
2   Alishba  Female     88          44
3    Fatima  Female     90          45
4     Adnan    Male     67          33

# Convert the Gender Column from Categorical to the Numerical Values

In [17]:
data["Gender-Values"]=data["Gender"].map({'Male':1,'Female':0})
data.head()

       Name  Gender  Marks  Half Marks  Gender-Values
0     Ahmed    Male     89          44              1
1  Abdullah    Male     77          38              1
2   Alishba  Female     88          44              0
3    Fatima  Female     90          45              0
4     Adnan    Male     67          33              1

# Dropping the Unnecessary Columns

In [18]:
data.drop(["Half Marks","Gender-Values"],axis=1,inplace=True)

In [19]:
data.head(1)

    Name Gender  Marks
0  Ahmed   Male     89

# Print the Names of Columns

In [20]:
data.columns

Index(['Name', 'Gender', 'Marks'], dtype='object')

In [21]:
data.index

RangeIndex(start=0, stop=8, step=1)

In [26]:
data.sort_values(by="Marks",ascending=False)

       Name  Gender  Marks
6    Ayesha  Female     91
3    Fatima  Female     90
0     Ahmed    Male     89
2   Alishba  Female     88
5      Ravi    Male     86
7   Tanveer    Male     79
1  Abdullah    Male     77
4     Adnan    Male     67

In [27]:
data.set_index("Name")

          Gender  Marks
Name
Ahmed       Male     89
Abdullah    Male     77
Alishba   Female     88
Fatima    Female     90
Adnan       Male     67
Ravi        Male     86
Ayesha    Female     91
Tanveer     Male     79

In [29]:
data

       Name  Gender  Marks
0     Ahmed    Male     89
1  Abdullah    Male     77
2   Alishba  Female     88
3    Fatima  Female     90
4     Adnan    Male     67
5      Ravi    Male     86
6    Ayesha  Female     91
7   Tanveer    Male     79

# Display the Name & Marks of the Female Students

In [35]:
data[data['Gender']=="Female"][['Name','Marks']]

      Name  Marks
2  Alishba     88
3   Fatima     90
6   Ayesha     91